In [3]:
import pandas as pd
import numpy as np

In [16]:
data=pd.DataFrame(np.arange(1,17).reshape((4,4)),index=['A','B','C','D'],columns=['un','deux','trois','quatre'])

In [17]:
data

   un  deux  trois  quatre
A   1     2      3       4
B   5     6      7       8
C   9    10     11      12
D  13    14     15      16

In [18]:
data.drop('A')

   un  deux  trois  quatre
B   5     6      7       8
C   9    10     11      12
D  13    14     15      16

In [19]:
data.drop(['A','D'])

   un  deux  trois  quatre
B   5     6      7       8
C   9    10     11      12

In [20]:
data.drop('un',axis=1)

   deux  trois  quatre
A     2      3       4
B     6      7       8
C    10     11      12
D    14     15      16

In [21]:
data.drop(['un','quatre'],axis='columns')

   deux  trois
A     2      3
B     6      7
C    10     11
D    14     15

In [22]:
data['deux']

A     2
B     6
C    10
D    14
Name: deux, dtype: int64

In [23]:
data[['un','trois']]

   un  trois
A   1      3
B   5      7
C   9     11
D  13     15

In [24]:
data[:2]

   un  deux  trois  quatre
A   1     2      3       4
B   5     6      7       8

In [25]:
data[data['trois']>5]

   un  deux  trois  quatre
B   5     6      7       8
C   9    10     11      12
D  13    14     15      16

In [26]:
data.loc['A',['deux','trois']]

deux     2
trois    3
Name: A, dtype: int64

In [28]:
data.iloc[0,[1,2]]

deux     2
trois    3
Name: A, dtype: int64

In [30]:
data.iloc[2]#c'est donc la troisi√®me ligne

un         9
deux      10
trois     11
quatre    12
Name: C, dtype: int64

In [31]:
data.loc[:'C','deux']

A     2
B     6
C    10
Name: deux, dtype: int64

In [32]:
data.loc[:'B',:'deux']

   un  deux
A   1     2
B   5     6

In [38]:
data.loc[:'B',:'deux']

   un  deux
A   1     2
B   5     6

In [40]:
data.iloc[:2,:2]

   un  deux
A   1     2
B   5     6

In [41]:
f=lambda x:x.max()-x.min()

In [45]:
data.apply(f,axis='columns')

A    3
B    3
C    3
D    3
dtype: int64

In [46]:
data.sort_index()

   un  deux  trois  quatre
A   1     2      3       4
B   5     6      7       8
C   9    10     11      12
D  13    14     15      16

In [49]:
data.sort_values(by=['un'],ascending=False)

   un  deux  trois  quatre
D  13    14     15      16
C   9    10     11      12
B   5     6      7       8
A   1     2      3       4

In [60]:
data['un'].value_counts()

13    1
5     1
9     1
1     1
Name: un, dtype: int64

In [61]:
data['un'].nunique()

4

In [59]:
data['un'].mean()

7.0

In [64]:
data.mean(axis=1)

A     2.5
B     6.5
C    10.5
D    14.5
dtype: float64

In [65]:
data.std()

un        5.163978
deux      5.163978
trois     5.163978
quatre    5.163978
dtype: float64